#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.AIAcademyLandingPage.heroku_app.ai_academy: Refreshing state... [id=ai-academy-landing-page]
module.Edumet.cloudflare_record.edumet: Refreshing state... [id=b97af57acb96854bd8531798abdd7a8d]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=d9e619af5ed3a3229b73c1179bd37a77]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.Edumet.cloudflare_record.edumet_www: Refreshing state... [id=168e062ff02b73fdc10ea286011b0151]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_2: Refreshing state... [id=a5375d4fa013a7250d1f22dd5cb23e47]
module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=6e9cfbacb5fa5c433735b7be41fee631]
module.AIAcademyLandingPage.cloudflare_record.ai_academy: Refreshing state... [id=cc06eaee39d703d204c9233dd99b3ec7]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_5: Refreshing state... [id=b6758c86fbd62dec46e0ad573d11fbc4]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_1: Refreshing state... [id=3582aff137e0b139f4a62723944643ef]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_3: Refreshing state... [id=c637dde6b0a6ca0b95a9290488db1e4f]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_4: Refreshing state... [id=b4f9e88334045a0e35152b58812bb713]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.EtronServiceAPI.cloudflare_record.etron_api: Refreshing state... [id=0f35a1045d7771138aa21b19aef7f343]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]
module.TestReady.heroku_domain.testready: Refreshing state... [id=4853ba53-4640-44cd-8bca-78b3e07c10e1]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=fab695c8-ee64-4530-abef-ba4ea9141f6e]
module.PersonalBlog.heroku_app.megatunger_blog: Refreshing state... [id=megatunger-blog]
module.EtronServiceAPI.heroku_app.etron_api: Refreshing state... [id=etron-service-api]
module.SolveX.cloudflare_record.www_solvex: Refreshing state... [id=02167562fc156ab2230e9e261380828a]
module.SolveX.cloudflare_record.sendgrid_2: Refreshing state... [id=a039cf16b7ac184277b1ecaab0d04609]
module.SolveX.cloudflare_record.sendgrid_3: Refreshing state... [id=c4b8454a9d71b68bfc6b28ceb9d754b8]
module.SolveX.cloudflare_record.solvex: Refreshing state... [id=ac93fa368b3a8aadef8954935207cfc8]
module.SolveX.cloudflare_record.sendgrid_1: Refreshing state... [id=b5523c95faab9fda12b0e5f442cf4090]
module.SolveX.heroku_app.solvex: Refreshing state... [id=solve-x]
module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.PersonalBlog.cloudflare_record.www_megatunger: Refreshing state... [id=b98af5802fc48600cad3132f0f56f7cd]
module.Edumet.heroku_app.edumet: Refreshing state... [id=edumet]
module.PersonalBlog.cloudflare_record.megatunger: Refreshing state... [id=284f02403cab8e2f8169585c87c2106d]
module.BinhMinhIdCardAPI.heroku_domain.bmidcard_api: Refreshing state... [id=63afcda1-ddd2-480d-97fe-d6ed20816909]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=ecb8f54e-69c9-4342-b1d8-e6c6d03f0796]
module.AIAcademyLandingPage.heroku_build.ai_academy: Refreshing state... [id=335c2bfe-9cf2-4164-8eeb-78eb8f37f84d]
module.AIAcademyLandingPage.heroku_domain.ai_academy: Refreshing state... [id=52afc77c-564d-4697-a82c-02d6f5ba628a]
module.PersonalBlog.heroku_build.megatunger_blog: Refreshing state... [id=e908dbbc-5c5d-48cf-853f-2be1b3547987]
module.PersonalBlog.heroku_domain.megatunger_blog: Refreshing state... [id=a69d9820-bf34-41d1-93d7-43b90cb17098]
module.PersonalBlog.heroku_domain.www_megatunger_blog: Refreshing state... [id=c24ce942-25fc-496c-9ce7-ac0e85a9cf44]
module.EtronServiceAPI.heroku_build.etron_api: Refreshing state... [id=3dcf0133-e420-46a6-b77f-4a07f31f3840]
module.EtronServiceAPI.heroku_domain.etron_api: Refreshing state... [id=0c7fe181-dcac-408f-8b44-84d07f9a3fda]
module.SolveX.heroku_domain.www_solvex: Refreshing state... [id=be5e491b-f397-48f3-9700-d8f4ac09161c]
module.LuaLepAPI.heroku_domain.lualep: Refreshing state... [id=54cfdaca-219d-472c-a4c1-dcbd8d18f5e2]
module.SolveX.heroku_build.solvex: Refreshing state... [id=1f7169c6-9a10-4ac5-be19-e55ade571b8a]
module.SolveX.heroku_domain.solvex: Refreshing state... [id=c0c01379-8113-4f2c-a6c2-a1e0d4fb7db7]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=8f168cb6-c51e-4f6a-a8d0-2594681b7c16]
module.SolveX.heroku_addon.database: Refreshing state... [id=c41f69a1-4745-45e9-ab79-35da5d43423c]
module.SolveX.heroku_addon.redis: Refreshing state... [id=282f8acf-e795-4162-b0d1-a1b22629221c]
module.Edumet.heroku_domain.edumet: Refreshing state... [id=c4d967e1-6c5f-45aa-8da7-968488a17069]
module.Edumet.heroku_build.edumet: Refreshing state... [id=87534114-49fd-45c6-a5df-270f16624660]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.uCall.cloudflare_record.ucall_app will be created
  + resource "cloudflare_record" "ucall_app" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "ucall-app"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "ucall-app.herokuapp.com"
      + zone_id     = "e0afe2a0b9c6ec0f92b8f06b007877b4"
    }

  # module.uCall.cloudflare_record.ucall_landingpage will be created
  + resource "cloudflare_record" "ucall_landingpage" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "ucall"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "ucall.herokuapp.com"
      + zone_id     = "e0afe2a0b9c6ec0f92b8f06b007877b4"
    }

  # module.uCall.heroku_app.ucall_app will be created
  + resource "heroku_app" "ucall_app" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "ucall-app"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.uCall.heroku_app.ucall_landingpage will be created
  + resource "heroku_app" "ucall_landingpage" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "ucall"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.uCall.heroku_build.ucall_app will be created
  + resource "heroku_build" "ucall_app" {
      + app               = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://api.github.com/repos/megatunger/eCall/tarball?access_token=2979285c8a761ceeac7728268f8c4f82ebe372e0"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.uCall.heroku_build.ucall_landingpage will be created
  + resource "heroku_build" "ucall_landingpage" {
      + app               = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://github.com/megatunger/eCall-LandingPage/archive/main.tar.gz"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.uCall.heroku_domain.ucall will be created
  + resource "heroku_domain" "ucall" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "ucall.etronresearch.work"
      + id       = (known after apply)
    }

  # module.uCall.heroku_domain.ucall_app will be created
  + resource "heroku_domain" "ucall_app" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "ucall-app.etronresearch.work"
      + id       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*